================================================================================
Unary expression
================================================================================

a: -12 â‚¬
b: - ab


--------------------------------------------------------------------------------

(source_file
  (rule
    (name)
    (ar_unary_expression
      (number
        (units
          (unit)))))
  (rule
    (name)
    (ar_unary_expression
    (reference
      (name)))))



================================================================================
Binary expression
================================================================================

a: b  + c
b: c *  d
c: a  - 5
d: 12 + 1


--------------------------------------------------------------------------------
(source_file
  (rule
    (name)
    (ar_binary_expression
      (reference
        (name))
      (reference
        (name))))
  (rule
    (name)
    (ar_binary_expression
      (reference
        (name))
      (reference
        (name))))
  (rule
    (name)
    (ar_binary_expression
      (reference
        (name))
      (number)))
  (rule
    (name)
    (ar_binary_expression
      (number)
      (number)))
)

================================================================================
Binary expression starting with numbers
================================================================================

c1: 4 - 5
d: 12 - e
e: 7 * a
f: 8 / pou
g: 10 + cool

--------------------------------------------------------------------------------
(source_file
  (rule
    (name)
    (ar_binary_expression
      (number)
      (number)))
  (rule
    (name)
    (ar_binary_expression
      (number)
            (reference
        (name))))
  (rule
    (name)
    (ar_binary_expression
      (number)
            (reference
        (name))))
  (rule
    (name)
    (ar_binary_expression
      (number)
            (reference
        (name))))
  (rule
    (name)
    (ar_binary_expression
      (number)
            (reference
        (name)))))

================================================================================
Associativity
================================================================================

a: 4 + c + d
b: 1 - 4.5 * 45 + 5
c: (12 - e) + 4

--------------------------------------------------------------------------------

    (source_file
      (rule
        (name)
        (ar_binary_expression
          (ar_binary_expression
            (number)
(reference
              (name)))
          (reference
            (name))))

      (rule
        (name)
        (ar_binary_expression
          (ar_binary_expression
            (number)
            (ar_binary_expression
              (number)
              (number)))
          (number)))
      (rule
        (name)
        (ar_binary_expression
          (ar_binary_expression
            (number)
   (reference
              (name)))
          (number))))


=============
Error unary -
:error
=============
c: a -5
-------------

=============
Error without spaces
:error
=============
c: 1+5
-------------

=============
Can't mix number and boolean (TODO)
:error
:skip
=============
c: 4.5 - oui
-------------


=============
Error with string
:error
=============
c: 4.5 + "ab"
-------------

=============
Error with date
:error
=============
c: 01/12/2024 + 41 jours
-------------