================================================================================
Reference with `-`
================================================================================

rule: CSG-CRDS

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (reference
        (dotted_name
          (name))))))

================================================================================
Reference with mechanism name
================================================================================

rule: somme

rule: sécurité sociale plafond

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (reference
        (dotted_name
          (name)))))
  (rule
    (dotted_name
      (name))
    (rule_body
      (reference
        (dotted_name
          (name))))))

================================================================================
Reference with mechanism name in array mechanism
================================================================================

rule:
  somme:
    - sécurité sociale plafond
    - somme
    - plafond

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (mechanism
        (m_array
          (m_array_name)
          (reference
            (dotted_name
              (name)))
          (reference
            (dotted_name
              (name)))
          (reference
            (dotted_name
              (name))))))))

================================================================================
Reference indented with special characters and reserved words
================================================================================

a:
       valeur:
               sécurité sociale plafond

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (reference
            (dotted_name
              (name))))))))

================================================================================
Malformed reference ending with a `.`
================================================================================

a:
 valeur: namespace .
 unité: km

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (reference
            (dotted_name
              (name)))))
      (ERROR)
      (mechanism
        (m_unité
          (unité)
          (units
            (unit)))))))
