================================================================================
Simple rule with new line - YAML style
================================================================================

a:
  "'Hello world'"
--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name (name))
    (rule_body (string))))

================================================================================
Rule with valeur mechanism - YAML style
================================================================================

a:
  valeur: 5

b:
  valeur:
    '5'
c:
  formule: oui

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))))
  (rule
    (dotted_name (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))))
  (rule
    (dotted_name (name))
    (rule_body
      (s_formule
        (formule)
        (boolean)))))

================================================================================
Rule with weird indentation (TODO : should be error ?)
================================================================================

a:
  valeur:
  5

--------------------------------------------------------------------------------
(source_file
  (rule
    (dotted_name (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number))))))


================================================================================
Rules with comments
================================================================================
a: # COMZ
#COMZ
  # COMZ
  valeur: 4 + 5 # COMZ
# COMZ
  # COMZ :
b:
--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name (name))
    (comment)
    (comment)
    (comment)
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (ar_binary_expression
            (number)
            (number))
          (comment)
          (comment)
          (comment)))))
  (rule
    (dotted_name (name))
    (rule_body)))

================================================================================
Doesn't allow tab for indenting
:error
================================================================================

a:
	5

--------------------------------------------------------------------------------


================================================================================
Accept single quote or double quote arround valeur - YAML style
================================================================================

a:
  valeur: "5"

b:
  valeur: '5'


--------------------------------------------------------------------------------
    (source_file
      (rule
        (dotted_name (name))
        (rule_body
          (mechanism
            (m_unary
              (m_unary_name)
              (number)))))
      (rule
        (dotted_name (name))
        (rule_body
          (mechanism
            (m_unary
              (m_unary_name)
              (number))))))


================================================================================
Accept single quote or double quote arround reference - YAML style (TODO?)
:skip
================================================================================

a: "a"
c: 'oui'

--------------------------------------------------------------------------------

================================================================================
Rule privé
================================================================================

[privé] a:
  valeur: 5

b:
  valeur: 5
  privé: oui

--------------------------------------------------------------------------------

(source_file
  (rule
    (tag)
    (dotted_name (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))))
  (rule
    (dotted_name (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))
      (tag))))
