================================================================================
Simple rule with new line - YAML style
================================================================================

a:
  "'Hello world'"
--------------------------------------------------------------------------------

(source_file
  (rule
    (name)
    (string)))

================================================================================
Rule with valeur mecanism - YAML style
================================================================================

a:
  valeur: 5

b:
  valeur: 
    '5'
c:
  formule: oui



--------------------------------------------------------------------------------

(source_file
  (rule
    (name)
    (rule_body
      (mechanism
        (m_unary
          (number)))))
  (rule
    (name)
    (rule_body
      (mechanism
        (m_unary
          (number)))))
  (rule
    (name)
    (rule_body
      (formule
        (boolean)))))

================================================================================
Rule with weird indentation (TODO : should be error ?)
================================================================================

a:
  valeur:
  5
  
--------------------------------------------------------------------------------
(source_file
  (rule
    (name)
    (rule_body
      (mechanism
        (m_unary
          (number))))))


================================================================================
Rules with commentaire
================================================================================
a: # COMZ
#COMZ
  # COMZ
  valeur: 4 + 5 # COMZ
# COMZ
  # COMZ : 
b: 
--------------------------------------------------------------------------------

    (source_file
      (rule
        (name)
        (comment)
        (comment)
        (comment)
        (rule_body
          (mechanism
            (m_unary
              (ar_binary_expression
                (number)
                (number))
              (comment)
              (comment)
              (comment)))))
      (rule
        (name)))

================================================================================
Doesn't allow tab for indenting
:error
================================================================================

a:
	5

--------------------------------------------------------------------------------


================================================================================
Accept single quote or double quote arround valeur - YAML style
================================================================================

a:
  valeur: "5"

b:
  valeur: '5'


--------------------------------------------------------------------------------
    (source_file
      (rule
        (name)
        (rule_body
          (mechanism
            (m_unary
              (number)))))
      (rule
        (name)
        (rule_body
          (mechanism
            (m_unary
              (number))))))


================================================================================
Accept single quote or double quote arround reference - YAML style (TODO?)
:skip
================================================================================

a: "a"
c: 'oui'

--------------------------------------------------------------------------------
  
================================================================================
Rule privé
================================================================================

[privé] a:
  valeur: 5

b: 
  valeur: 5
  privé: oui

--------------------------------------------------------------------------------

(source_file
  (rule
    (tag)
    (name)
    (rule_body
      (mechanism
        (m_unary
          (number)))))
  (rule
    (name)
    (rule_body
      (mechanism
        (m_unary
          (number)))
      (tag))))
