================================================================================
Rule with titre
================================================================================

a:
  titre: Yay

b:
  titre: "Yay"
  valeur: 4

c:

  valeur: 6

  titre: "çàkdf&ok'hf   fnk&ẰÉ


d:
  titre: 10
--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)))))
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)))
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))))
  (rule
    (dotted_name
      (name))
    (rule_body
      (mechanism
        (m_unary
          (m_unary_name)
          (number)))
      (meta
        (meta_name)
        (meta_value
          (text_line)))))
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line))))))

================================================================================
Meta string indented
================================================================================
a:
  titre:
    pitou

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line))))))

================================================================================
Meta multiple lines string without starting line
================================================================================
x:
  description:
    Poulie  4
    Perpouix
    zdsz : 5

a: 5
--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)
          (text_line)
          (text_line)))))
  (rule
    (dotted_name
      (name))
    (rule_body
      (number))))

================================================================================
Meta multiple lines with starting line
================================================================================
x:
  description: Lorsque la durée d'un contrat de travail est : "inférieure"
    il est possible d'appliquer un abattement pour diminuer le montant du
    prélèvement à la source : c'est top
  valeur: 4

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)
          (text_line)
          (text_line)))
      (mechanism
        (m_unary
          (m_unary_name)
          (number))))))

================================================================================
Meta multiple lines with starting line and comments
================================================================================
x:
  description: Lorsque la durée d'un contrat de travail est inférieure # COMMENT
     # COMMENT
    il est possible d'appliquer un abattement pour diminuer le montant du # COMMENT
    Zooo
    # COMMENT

    jdioz
    prélèvement à la source # Ceci est un commentaire
  # COMMENT
  valeur: 4

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)
          (comment)
          (comment)
          (text_line)
          (comment)
          (text_line)
          (comment)
          (text_line)
          (text_line)
          (comment)
          (comment)))
      (mechanism
        (m_unary
          (m_unary_name)
          (number))))))

================================================================================
Rule with références
================================================================================

a:
  références:
    Article 1 du code civil: https://www.legifrance.gouv.fr/affichCodeArticle.do?idArticle=LEGIARTI000006417248&cidTexte=LEGITEXT000006070721
    Quel est le meilleur langage pour écrire la loi ? : "https://publi.codes"


    "This is the best link : that's for sure": "https://www.wikipedia.org"

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (object
            (meta_value
              (text_line))
            (meta_value
              (text_line))
            (meta_value
              (text_line))))))))

================================================================================
Rule with empty meta
================================================================================
a:
  description: |
  notes: |

  titre:
  question: ""

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (paragraph)))
      (meta
        (meta_name)
        (meta_value
          (paragraph)))
      (meta
        (meta_name)
        (meta_value))
      (meta
        (meta_name)
        (meta_value
          (text_line))))))

================================================================================
Meta paragraph - 1
================================================================================
a:
  notes: |
    # Ce titre n'est pas un commentaire car il est dans un texte

    - A noter : ceci
    - et cela

    **Dans l’idéal, on devrait supporter le markdown**
  description: >
    Ceci aussi est un paragraphe

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (paragraph)))
      (meta
        (meta_name)
        (meta_value
          (paragraph))))))

================================================================================
Meta paragraph with comment
================================================================================

b:
  description: | # Ceci est un commentaire
    Ceci est le début du texte
      Avec une indentation
    # Ceci n'est pas un commentaire
  # Ceci est un commentaire
  valeur: 4

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (comment)
          (paragraph)))
      (comment)
      (mechanism
        (m_unary
          (m_unary_name)
          (number))))))

================================================================================
Paragraph cannot contain comments
:error
================================================================================
a:
  notes: |
  # Ceci est un bug
    lala
--------------------------------------------------------------------------------

================================================================================
Rule with all the supported meta
================================================================================

a:
  titre: Ma super règle
  description: |

  notes:  Attention, cette règle est très importante
  question: "Combien font 2 + 2 ?"
  références:
    1 : "https://www.wikipedia.org"
    # Ceci est un commentaire
    2 :
      "https://theguardian.com" # Ceci aussi

--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (meta
        (meta_name)
        (meta_value
          (text_line)))
      (meta
        (meta_name)
        (meta_value
          (paragraph)))
      (meta
        (meta_name)
        (meta_value
          (text_line)))
      (meta
        (meta_name)
        (meta_value
          (text_line)))
      (meta
        (meta_name)
        (meta_value
          (object
            (meta_value
              (text_line)
              (comment))
            (meta_value
              (text_line)
              (comment))))))))

================================================================================
Custom meta
================================================================================
a:
  suggestions:
    rule1: non
    rule2: oui
  _cdtn:
    valeur: 4
--------------------------------------------------------------------------------

(source_file
  (rule
    (dotted_name
      (name))
    (rule_body
      (custom_meta
        (meta_value
          (object
            (meta_value
              (text_line))
            (meta_value
              (text_line)))))
      (custom_meta
        (meta_value
          (object
            (meta_value
              (text_line))))))))
